sisext-sapi-services/src/main/resources/soap/schemas/templates/inetum-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" >
   <soapenv:Header/>
   <soapenv:Body>
      <receiveMessage xmlns="http://service.client.xcewsmulti.iecisa.es">
         <userId>#[p('inetum.user')]</userId>
         <password>#[p('inetum.pass')]</password>
         <xmlMsg>#[payload]</xmlMsg>
      </receiveMessage>
   </soapenv:Body>
</soapenv:Envelope>